Repository: awesome-academy/duy_mock_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: This field may not be blank.
vi: Trường này không được để trống.

source: This field must be unique.
vi: Giá trị này đã tồn tại, vui lòng chọn giá trị khác.

source: The fields {field_names} must make a unique set.
vi: Sự kết hợp giữa các trường {field_names} đã tồn tại.

source: Ensure this field has no more than {max_length} characters.
vi: Trường này không được có nhiều hơn {max_length} ký tự.

source: Ensure this field has at least {min_length} characters.
vi: Trường này phải có ít nhất {min_length} ký tự.

source: Enter a valid email address.
vi: Vui lòng nhập một địa chỉ email hợp lệ.

source: Refresh token is required.
vi: Cần phải có mã thông báo làm mới.

source: Successfully logged out.
vi: Đã đăng xuất thành công.

source: Token is blacklisted
vi: Mã thông báo bị đưa vào danh sách đen

source: User registered successfully. Please check your email to verify your account.
vi: Người dùng đã đăng ký thành công. Vui lòng kiểm tra email để xác minh tài khoản của bạn.

source: Email verified successfully. You can now log in.
vi: Email đã được xác minh thành công. Bây giờ bạn có thể đăng nhập.

source: Activation link is invalid or has expired.
vi: Liên kết kích hoạt không hợp lệ hoặc đã hết hạn.

source: User with this email does not exist.
vi: Người dùng với email này không tồn tại.

source: Password has been reset successfully.
vi: Mật khẩu đã được đặt lại thành công.

source: Password reset link is invalid or has expired.
vi: Liên kết đặt lại mật khẩu không hợp lệ hoặc đã hết hạn.

source: A password reset email has already been sent recently. Please check your inbox.
vi: Một email đặt lại mật khẩu đã được gửi gần đây. Vui lòng kiểm tra hộp thư đến của bạn.

source: The requested resource was not found.
vi: Không tìm thấy tài nguyên được yêu cầu.

source: An internal server error occurred.
vi: Đã xảy ra lỗi máy chủ nội bộ.

source: Latitude and longitude must be numeric values.
vi: Vĩ độ và kinh độ phải là các giá trị số.

source: Latitude must be between -90 and 90.
vi: Vĩ độ phải nằm trong khoảng từ -90 đến 90.

source: Longitude must be between -180 and 180.
vi: Kinh độ phải nằm trong khoảng từ -180 đến 180.

source: Working space created successfully.
vi: Không gian làm việc đã được tạo thành công.

source: Working space retrieved successfully.
vi: Không gian làm việc đã được truy xuất thành công.

source: Working space updated successfully.
vi: Không gian làm việc đã được cập nhật thành công.

source: Working space deleted successfully.
vi: Không gian làm việc đã được xóa thành công.

source: You do not have permission to perform this action.
vi: Bạn không có quyền thực hiện hành động này.
